// ___ = இவை எல்லாம் UTF-8 குறிகளைக்குறிக்கும் மாறிகள்

const உயிர்___ = ["அ", "ஆ", "இ", "ஈ", "உ", "ஊ", "எ", "ஏ", "ஐ", "ஒ", "ஓ", "ஔ"];

const உயிர்மெய்___ = [
    "", "ா", "ி", "ீ", "ு", "ூ", "ெ", "ே", "ை", "ொ", "ோ", "ௌ", "ஃ"
];

const மெய்___ = [
    "க", "ச", "ட", "த", "ப", "ற", "ஞ", "ங", "ண", "ந", "ம", "ன", "ய", "ர", "ல", "வ", "ழ", "ள",
];


function எழுத்துக்கள்(உள்ளிடு) {
    const எழுத்துக்கள் = []
    const எண் = 0
    for (அ=0;அ<= உள்ளிடு.length;அ++) {
        if ( உயிர்___.includes(உள்ளிடு[அ]) ){
            console.log("உயிர்");
        }else if(மெய்___.includes(உள்ளிடு[அ])){
            console.log("மெய்");
        }
        else{
            console.log("------");
        }
        console.log(அ);
        
    }
}

எழுத்துக்கள்('அம்மா')


இறுதி()
//checking was it starting letter

முதல்()
//checking was it ending letter

இடையில்()
//checking was this letter present inside this word

எத்துனையெழுத்துக்கள்()

எத்துனைமெய்()

எத்துனைவுயிர்()

எத்துனைவுயிர்மெய்()

உயிர்மெய்யாதல்()

உயிர்நீங்கள்()

மெய்நீங்கள்()

வல்லினயினம்()

